<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-css-stripe","backend_type":"remote","backend":"13a406057d1a8be9aac6c7a3ea04ddcfc4171c902e1e83e3f5dee6a28d482979","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #283 at https://github.com/scidsg/hushline/actions/runs/10930949820","plan_out_hash":"b2fbcfc4a369b51da1402e24b25c622bbc1f31ef4fcf902b1fe6f56b51e1b23a","plan_hash":"c054be65e840e96c642096919efbd0fe33dc060c1271702b950d15a158d7e645","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-css-stripe__ workspace<details open><summary>With variables</summary>

```hcl
branch = "css-stripe"
name   = "dev-css-stripe"
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_project.hush_line_dev will be created
+   resource "digitalocean_project" "hush_line_dev" {
+       created_at  = (known after apply)
+       description = "Development instance based on the css-stripe branch"
+       environment = "Development"
+       id          = (known after apply)
+       is_default  = false
+       name        = "dev-css-stripe"
+       owner_id    = (known after apply)
+       owner_uuid  = (known after apply)
+       purpose     = "Web Application"
+       resources   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains  = (known after apply)
+           features = [
+               "buildpack-stack=ubuntu-22",
            ]
+           name     = "dev-css-stripe"
+           region   = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "css-stripe"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
+           service {
+               http_port          = (known after apply)
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = [
+                   5432,
                ]
+               name               = "db"
+               run_command        = (known after apply)

+               image {
+                   registry      = "library"
+                   registry_type = "DOCKER_HUB"
+                   repository    = "postgres"
+                   tag           = "16.4-alpine3.20"

+                   deploy_on_push (known after apply)
                }

+               routes (known after apply)
            }
        }
    }

  # module.app.random_password.local_db_password will be created
+   resource "random_password" "local_db_password" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 16
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "!#$%&*()-_=+[]{}<>:?"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #283](https://github.com/scidsg/hushline/actions/runs/10930949820)